ruvi-d/STM32DDRFW-UTIL/DDR_Tool/Common_MP2/Src/ddr_tool.c
/**
  ******************************************************************************
  * @file    ddr_tool.c
  * @author  MCD Application Team
  * @brief   Main file for HAL DDR tool.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32_device_hal.h"

#include "string.h"
#include "stdlib.h"
#include "ddr_tool.h"
#include "stm32mp_util_conf.h"

/* Private typedef -----------------------------------------------------------*/
typedef struct {
  uint32_t (*fct)();
  const char *name;
  const char *usage;
  const char *help;
  uint8_t max_args;
} subcmd_desc;

typedef enum {
  DDR_CMD_HELP = 0,
  DDR_CMD_INFO,
  DDR_CMD_FREQ,
  DDR_CMD_RESET,
  DDR_CMD_PARAM,
  DDR_CMD_IMPEDANCE,
  DDR_CMD_PRINT,
  DDR_CMD_EDIT,
  DDR_CMD_SAVE,
  DDR_CMD_STEP,
  DDR_CMD_NEXT,
  DDR_CMD_GO,
  DDR_CMD_TEST,
  DDR_CMD_UNKNOWN,
  DDR_CMD_TEST_HELP,
  DDR_CMD_MAX,
} ddr_cmd_id;

typedef struct {
  char *str;
  uint8_t param_min;
  uint8_t param_max;
} ddr_command;

typedef struct {
  uint8_t off;
  uint8_t len;
} ddr_arg;

/* Private define ------------------------------------------------------------*/
#define CMD_MAX_LEN 1024
#define CMD_MAX_ARG 5
#define DDR_NAME_MAX_LEN 128

const subcmd_desc test[] = {
  {DDR_Test_All, "Test All",
   "[none] | [loop] | [loop] [size] | [loop] [size] [addr]",
   "Execute all tests", 3},
  {DDR_Test_Databus, "Test Simple DataBus", "[addr]",
   "Verifies each data line by walking 1 on fixed address", 1},
  {DDR_Test_DatabusWalk0, "Test DataBusWalking0", "[loop] [addr]",
   "Verifies each data bus signal can be driven low (32 word burst)", 2},
  {DDR_Test_DatabusWalk1, "Test DataBusWalking1", "[loop] [addr]",
   "Verifies each data bus signal can be driven high (32 word burst)", 2},
  {DDR_Test_AddressBus, "Test AddressBus", "[size] [addr]",
   "Verifies each relevant bits of the address and checking for aliasing", 2},
  {DDR_Test_MemDevice, "Test MemDevice", "[size] [addr]",
   "Test the integrity of a physical memory", 2},
  {DDR_Test_SimultaneousSwitchingOutput, "Test SimultaneousSwitchingOutput",
   "[size] [addr] ", "Stress the data bus over an address range", 2},
  {DDR_Test_Noise, "Test Noise", "[pattern] [addr]",
   "Verifies r/w while forcing switching of all data bus lines.", 2},
  {DDR_Test_NoiseBurst, "Test NoiseBurst", "[size] [pattern] [addr]",
   "burst transfers while forcing switching of the data bus lines", 3},
  {DDR_Test_Random, "Test Random", "[size] [loop] [addr]",
   "Verifies r/w and memcopy(burst for pseudo random value", 3},
  {DDR_Test_FrequencySelectivePattern, "Test FrequencySelectivePattern",
   "[size] [addr]", "write & test patterns: Mostly Zero, Mostly One and F/n",
   2},
  {DDR_Test_BlockSequential, "Test BlockSequential", "[size] [loop] [addr]",
   "test incremental pattern", 3},
  {DDR_Test_Checkerboard, "Test Checkerboard", "[size] [loop] [addr]",
   "test checker pattern", 3},
  {DDR_Test_BitSpread, "Test BitSpread", "[size] [loop] [addr]",
   "test Bit Spread pattern", 3},
  {DDR_Test_BitFlip, "Test BitFlip", "[size] [loop] [addr]",
   "test Bit Flip pattern", 3},
  {DDR_Test_WalkingZeroes, "Test WalkingZeroes", "[size] [loop] [addr]",
   "test Walking Ones pattern", 3},
  {DDR_Test_WalkingOnes, "Test WalkingOnes", "[size] [loop] [addr]",
   "test Walking Zeroes pattern", 3},
  {HAL_DDR_Test_DMA_Stress, "Test DMA stress", "[size] [loop] [nb_channels]",
   "test in DMA stress conditions", 3},
  {DDR_Test_TXComputeDelayMargins, "Computes TX DQS delay margins", "[none]",
   "computes TX DQS delay margins with present impedances", 0},
  {DDR_Test_RXComputeDelayMargins, "Computes RX DQS delay margins", "[none]",
   "computes RX DQS delay margins with present impedances", 0},
#ifdef TEST_INFINITE_ENABLE
  {DDR_Test_Infinite_write, "Test infinite write for JEDEC", "[pattern] [addr]",
   "test infinite write pattern", 2},
  {DDR_Test_Infinite_read, "Test infinite read for JEDEC", "[pattern] [addr]",
   "test infinite read pattern", 2},
#endif
};

const int test_nb = sizeof(test) / sizeof(test[0]);

/* Following definitions may be updated if new tests are added */
#define TEST_ARG_TX_DELAY_MARGINS "18\0"
#define TEST_ARG_RX_DELAY_MARGINS "19\0"

const char *step_str[] = {
    [STEP_DDR_RESET] = "DDR_RESET",
    [STEP_CTL_INIT]  = "DDR_CTRL_INIT_DONE",
    [STEP_PHY_INIT]  = "DDR_PHY_INIT_DONE",
    [STEP_DDR_READY] = "DDR_READY",
    [STEP_RUN]       = "RUN"
};

const ddr_command ddr_cmd[DDR_CMD_MAX] = {
    [DDR_CMD_HELP]         = { "help"       , 0, 0 },
    [DDR_CMD_INFO]         = { "info"       , 0, CMD_MAX_ARG },
    [DDR_CMD_FREQ]         = { "freq"       , 0, 1 },
    [DDR_CMD_RESET]        = { "reset"      , 0, 0 },
    [DDR_CMD_PARAM]        = { "param"      , 0, 2 },
    [DDR_CMD_IMPEDANCE]    = { "impedance"  , 0, 2 },
    [DDR_CMD_PRINT]        = { "print"      , 0, 1 },
    [DDR_CMD_EDIT]         = { "edit"       , 2, 2 },
    [DDR_CMD_SAVE]         = { "save"       , 0, 0 },
    [DDR_CMD_STEP]         = { "step"       , 0, 1 },
    [DDR_CMD_NEXT]         = { "next"       , 0, 0 },
    [DDR_CMD_GO]           = { "go"         , 0, 0 },
    [DDR_CMD_TEST]         = { "test"       , 0, CMD_MAX_ARG },
    [DDR_CMD_TEST_HELP]    = { "test help"  , 0, 0 },
};

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
extern HAL_DDR_ConfigTypeDef static_ddr_config;

/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

uint32_t DDR_Test_All(uint32_t loop, uint32_t size, uint32_t addr)
{
  uint32_t ret = 0;
  int i;

/* Remove TXComputeDelayMargins and RXComputeDelayMargins from "All" list of tests */
#ifdef TEST_INFINITE_ENABLE
  for (i = 1; i < (int)test_nb - 2 - 2; i++)
#else
  for (i = 1; i < (int)test_nb - 2; i++)
#endif
  {
    switch (test[i].max_args)
    {
      case 1:
        ret = test[i].fct(addr);
        break;
      case 2:
        if (   (test[i].fct == DDR_Test_DatabusWalk0)
            || (test[i].fct == DDR_Test_DatabusWalk1))
        {
          ret = test[i].fct(loop, addr);
        }
        else if (test[i].fct == DDR_Test_Noise)
        {
          ret = test[i].fct(0, addr);
        }
        else
        {
          ret = test[i].fct(size, addr);
        }
        break;
      case 3:
        if (test[i].fct == DDR_Test_NoiseBurst)
        {
          ret = test[i].fct(size, 0, addr);
        }
        else if (test[i].fct == HAL_DDR_Test_DMA_Stress)
        {
          ret = test[i].fct(size, 0, 12);
        }
        else
        {
          ret = test[i].fct(size, loop, addr);
        }
        break;
    }

    if (ret != 0)
    {
      if (!silent_console)
      {
        printf("%s failed [%d]\n\r", test[i].name, ret);
      }
      return ret;
    }

    if (!silent_console)
    {
      printf("result %d:%s = Passed\n\r", i, test[i].name);
    }
  }

  return ret;
}

static void get_entry_string(char *entry)
{
  uint8_t user_entry_valid = 0;
  char user_entry_value = 0;
  int i = 0;

  Serial_Putchar(0xd);
  Serial_Putchar('D');
  Serial_Putchar('D');
  Serial_Putchar('R');
  Serial_Putchar('>');

  while(user_entry_valid == 0)
  {
    /* Scan for user entry */
    user_entry_value = Serial_Scanf(255);
    /* Print the entry character */
    Serial_Putchar(user_entry_value);

    if (user_entry_value == 0xd)
    {
      entry[i] = '\0';
      printf("\r\n");
      user_entry_valid = 1;
    }
    else if (user_entry_value == 0x18)
    {
      i--;
    }
    else
    {
      entry[i++] = user_entry_value;
    }
  }
}

static int parse_entry_string(char *entry, size_t size, int *command,
                              char *argv[])
{
  int i = 0;
  int n = 0;
  ddr_arg cmd = {0, 0};
  ddr_arg arg = {0, 0};

