ruvi-d/STM32DDRFW-UTIL/DDR_Tool/Common_MP2/Src/ddr_tool.c
  /* Identify command and parameters */
  for (i = 0; i < (int)size; i++)
  {
    if (entry[i] == '\0')
    {
      break;
    }
    if (entry[i] == ' ')
    {
      continue;
    }

    if (n == 0)
    {
      cmd.off = i;
    }
    else
    {
      arg.off = i;
    }

    while ((entry[i] != ' ') && (entry[i] != '\0'))
    {
      i++;
    }

    if (n == 0)
    {
      cmd.len = i - cmd.off;
    }
    else
    {
      arg.len = i - arg.off;
      strncpy(argv[n - 1], &entry[arg.off], arg.len);
      strncpy(argv[n - 1] + arg.len, "\0", 1);
    }

    n++;

    if (n > CMD_MAX_ARG + 1)
    {
      printf("Too many arguments (max=%d)\n\r", CMD_MAX_ARG);
      return -1;
    }

    i--;
  }

  /* Case of empty string, simple ignore, no error */
  if ((n == 0) && (cmd.len == 0))
  {
    return 0;
  }

  /* Get command */
  for (i = 0; i < DDR_CMD_UNKNOWN; i++)
  {
    if (   !strncmp(&entry[cmd.off], ddr_cmd[i].str, cmd.len)
        && (cmd.len == strlen(ddr_cmd[i].str)))
    {
      *command = i;
      break;
    }
  }

  /* Case of unknown command */
  if (i == DDR_CMD_UNKNOWN)
  {
    printf("Unknown command\n\r");
    return -2;
  }

  /* Check number of parameters */
  if ((n - 1) < ddr_cmd[*command].param_min)
  {
    printf("%s: argument missing (min=%d)\n\r", ddr_cmd[*command].str,
                                                ddr_cmd[*command].param_min);
    return -3;
  } else if ((n - 1) > ddr_cmd[*command].param_max)
  {
    printf("%s: too many arguments (max=%d)\n\r", ddr_cmd[*command].str,
                                                  ddr_cmd[*command].param_max);
    return -4;
  }

  /* Case of commands with "help" first parameter, ignore other ones */
  if ((n >= 2) && (argv[0] != NULL))
  {
    if (!strcmp(argv[0], "help"))
    {
      switch (*command)
      {
      case DDR_CMD_TEST:
            *command = DDR_CMD_TEST_HELP;
            break;
      }
      return 1;
    }
  }

  /* return number of arguments, including command and parameters */
  return n;
}

static int64_t string_to_num(char *string)
{
  char *end_ptr;
  uint64_t val = strtoul(string, &end_ptr, 0);

  if (end_ptr == string)
  {
    return -1;
  }

  return val;
}

static void print_usage(void)
{
  const char *usage = {
    "commands:\n\r\n\r"
    "help                       displays help\n\r"
    "info                       displays DDR information\n\r"
    "info  <param> <val>        changes DDR information\n\r"
    "      with <param> = step, name, size or speed\n\r"
    "freq                       displays the DDR PHY frequency in kHz\n\r"
    "freq  <freq>               changes the DDR PHY frequency\n\r"
    "param [type|reg]           prints input parameters\n\r"
    "param <reg> <val>          edits parameters in step 0\n\r"
    "impedance [name]           prints impedances\n\r"
    "impedance <name> <val>     edits impedances in step 0\n\r"
    "print [type|reg]           dumps registers\n\r"
    "edit <reg> <val>           modifies one register\n\r"
    "save                       output formated DDR regs to be saved\n\r"
    "step                       lists the available step\n\r"
    "step <n>                   go to the step <n>\n\r"
    "next                       goes to the next step\n\r"
    "go                         continues the DDR TOOL execution\n\r"
    "reset                      reboots machine\n\r"
    "test [help] | <n> [...]    lists (with help) or executes test <n>\n\r"
    "\n\rwith for [type|reg]:\n\r"
    "  all registers if absent\n\r"
    "  <type> = ctl, uib, uia, uim, uis\n\r"
    "  <reg> = name of the register\n\r"
  };

  printf(usage);
}

static void print_single_subcmd_usage(const subcmd_desc *array, int i)
{

      printf("  %2d: %s %s\n\r", i, array[i].name, array[i].usage);
      printf("          %s\n\r", array[i].help);
}

static void print_subcmd_usage(const subcmd_desc *array, const int size)
{
  int i;

  printf("commands:\n\r\n\r");

  for (i = 0; i < size; i++)
  {
      print_single_subcmd_usage(array, i);
  }
}

static bool check_step(HAL_DDR_InteractStepTypeDef step,
                       HAL_DDR_InteractStepTypeDef expected)
{
  if (step != expected)
  {
    if (!silent_console)
    {
      printf("invalid step %d:%s expecting %d:%s\n\r",
             step, step_str[step], expected, step_str[expected]);
    }
    return false;
  }

  return true;
}

static bool pll2_set_rate(uint64_t pll2_clk_rate)
{
  RCC_PLLInitTypeDef PLL2;
  uint64_t fck_ref;
  uint64_t fbdiv;
  uint64_t value;

  HAL_RCCEx_GetPLL2Config(&PLL2);

  switch (PLL2.PLLSource)
  {
    case RCC_PLLSOURCE_HSI:
      fck_ref = HSI_VALUE;
      break;
    case RCC_PLLSOURCE_HSE:
      fck_ref = HSE_VALUE;
      break;
    default:
      printf("PLL2 OSC clock source is not set properly\n\r");
      return false;
  }

  /* Disable the PLL2 */
  PLL2.PLLState = RCC_PLL_OFF;
  if (HAL_RCCEx_PLL2Config(&PLL2) != HAL_OK)
  {
    return false;
  }

  /* Calculate new settings */
  fbdiv = pll2_clk_rate * PLL2.POSTDIV1 * PLL2.POSTDIV2 * PLL2.FREFDIV;
  PLL2.FBDIV = fbdiv / fck_ref;
  value = fbdiv % fck_ref;
  PLL2.FRACIN = (value * (1 << 24)) / fck_ref;

  /* Configure and enable the PLL2 */
  PLL2.PLLState = RCC_PLL_ON;
  if (HAL_RCCEx_PLL2Config(&PLL2) != HAL_OK)
  {
    return false;
  }

  return true;
}

static void do_info(HAL_DDR_InteractStepTypeDef step, int argc, char *argv[])
{
  unsigned long value;
  static char ddr_name[DDR_NAME_MAX_LEN];
  char *end_ptr;

  if (argc == 1)
  {
    printf("step = %d : %s\n\r", step, step_str[step]);
    printf("name = %s\n\r", static_ddr_config.info.name);
    printf("size = 0x%lx\n\r", static_ddr_config.info.size);
    printf("speed = %d kHz\n\r", static_ddr_config.info.speed);
    return;
  }

  if (argc < 3)
  {
    printf("not enough parameters\n\r");
    return;
  }

  if (!strcmp(argv[0], "name"))
  {
    int i;
    uint32_t name_len = argc;

    for (i = 1; i < (argc - 1); i++)
    {
      name_len += strlen(argv[i]) + 1;
    }

    static_ddr_config.info.name = ddr_name;

    strcpy(ddr_name, argv[1]);
    for (i = 2; i < (argc - 1); i++)
    {
      strcat(ddr_name, " ");
      strcat(ddr_name, argv[i]);
    }
    printf("name = %s\n\r", ddr_name);
    return;
  }

  if (!strcmp(argv[0], "size"))
  {
    value = strtoll(argv[1], &end_ptr, 16);
    if (end_ptr == argv[1])
    {
      printf("invalid value %s\n\r", argv[1]);
    }
    else
    {
      static_ddr_config.info.size = value;
      printf("size = 0x%lx\n\r", static_ddr_config.info.size);
    }
    return;
  }

  if (!strcmp(argv[0], "speed"))
  {

    value = strtoll(argv[1], &end_ptr, 10);
    if (end_ptr == argv[1])
    {
      printf("invalid value %s\n\r", argv[1]);
    }
    else
    {
      static_ddr_config.info.speed = value;
      printf("speed = %d kHz\n\r", static_ddr_config.info.speed);
      value = (unsigned long)HAL_RCCEx_GetPLL2ClockFreq() * 2;
      printf("DDRPHY = %ld kHz\n\r", value / 1000);
    }
    return;
  }

  printf("argument %s invalid\n\r", argv[0]);
}

