ruvi-d/STM32DDRFW-UTIL/DDR_Tool/Common_MP2/Src/ddr_tool.c
static bool do_freq(int argc, char *argv[])
{
  unsigned long frequency;
  unsigned long value;
  char *end_ptr;
  bool ret_code = true;

  if (argc == 2)
  {
    /* DDR freq = PLL2 freq * 2 */
    value = (strtoll(argv[0], &end_ptr, 0) * 1000) / 2;
    if (end_ptr == argv[0])
    {
      printf("invalid argument %s\n\r", argv[0]);
      return false;
    }

    frequency = (unsigned long)HAL_RCCEx_GetPLL2ClockFreq();
    if (value == frequency)
    {
      printf("Same frequency, no change.\n\r");
      return true;
    }
    else if (frequency == 0)
    {
      printf("Frequency has never been set before, no change.\n\r");
      return true;
    }
    else
    {
      ret_code = pll2_set_rate(value);
    }
  }

  frequency = (unsigned long)HAL_RCCEx_GetPLL2ClockFreq();
  printf("DDRPHY = %ld kHz\n\r", (2 * frequency) / 1000);

  return ret_code;
}

static void do_param(HAL_DDR_InteractStepTypeDef step, int argc, char *argv[])
{
  char reg_name[(argc == 1)? 0 : strlen(argv[0])];

  switch (argc)
  {
  case 1:
    HAL_DDR_Dump_Param(&static_ddr_config, NULL);
    break;
  case 2:
    HAL_DDR_Convert_Case(argv[0], reg_name, 1); /* convert to upper case */

    if (HAL_DDR_Dump_Param(&static_ddr_config, reg_name) != HAL_OK)
    {
      printf("invalid argument %s\n\r", argv[0]);
    }
    break;
  case 3:
    if (!check_step(step, STEP_DDR_RESET))
    {
      return;
    }
    HAL_DDR_Convert_Case(argv[0], reg_name, 1); /* convert to upper case */
    HAL_DDR_Edit_Param(&static_ddr_config, reg_name, argv[1]);
    break;
  }
}

static void do_impedance(HAL_DDR_InteractStepTypeDef step, int argc, char *argv[])
{
  char name[(argc == 1)? 0 : strlen(argv[0])];

  switch (argc)
  {
  case 1:
    HAL_DDR_Dump_Impedance(&static_ddr_config, NULL);
    break;
  case 2:
    HAL_DDR_Convert_Case(argv[0], name, 1); /* convert to upper case */

    if (HAL_DDR_Dump_Impedance(&static_ddr_config, name) != HAL_OK)
    {
      printf("invalid argument %s\n\r", argv[0]);
    }
    break;
  case 3:
    if (!check_step(step, STEP_DDR_RESET))
    {
      return;
    }
    HAL_DDR_Convert_Case(argv[0], name, 1); /* convert to upper case */
    HAL_DDR_Edit_Impedance(&static_ddr_config, name, argv[1]);
    break;
  }
}

static void do_print(HAL_DDR_InteractStepTypeDef step, int argc, char * const argv[])
{
  char reg_name[(argc == 1)? 0 : strlen(argv[0])];

  switch (argc)
  {
    case 1:
      HAL_DDR_Dump_Reg(NULL, false);
      break;
    case 2:
      HAL_DDR_Convert_Case(argv[0], reg_name, 1); /* convert to upper case */

      if (strcmp(reg_name, "VREF"))
      {
        if (HAL_DDR_Dump_Reg(reg_name, false) != HAL_OK)
        {
          printf("invalid argument %s\n\r", reg_name);
        }
      }
      else
      {
        if (check_step(step, STEP_DDR_READY))
        {
#if STM32MP_DDR4_TYPE
          HAL_DDR_Print_VREF(&static_ddr_config);
#endif /* STM32MP_DDR4_TYPE */
        }
      }
      break;
  }
}

static HAL_DDR_InteractStepTypeDef do_step(HAL_DDR_InteractStepTypeDef step,
                                           int argc, char *argv[])
{
  int i;
  unsigned long value;
  char *end_ptr;

  switch (argc)
  {
    case 1:
      for (i = 0; i <= STEP_RUN; i++)
      {
        printf("%d:%s\n\r", i, step_str[i]);
      }
      break;

    case 2:
      value = strtoll(argv[0], &end_ptr, 0);
      if ((end_ptr == argv[0]) || (value > STEP_RUN))
      {
        printf("invalid argument %s\n\r", argv[1]);
        goto end;
      }

      if ((value != STEP_DDR_RESET) && (value <= step))
      {
        printf("invalid target %d:%s, current step is %d:%s\n\r",
               (int)value, step_str[value], step, step_str[step]);
        goto end;
      }
      if (!silent_console)
      {
        printf("step to %d:%s\n\r", (int)value, step_str[value]);
      }
      return (HAL_DDR_InteractStepTypeDef)value;
  };

end:
  return step;
}

static char argv0[CMD_MAX_LEN / 4] = "\0";
static char argv1[CMD_MAX_LEN / 4] = "\0";
static char argv2[CMD_MAX_LEN / 4] = "\0";
static char argv3[CMD_MAX_LEN / 4] = "\0";

static void do_subcmd(int argc, char *argv[], const subcmd_desc *array,
                      const int size)
{
  int i;
  int64_t value;
  int local_argc = argc;
  uint32_t retcode;

  if (local_argc == 1)
  {
    printf("Please enter a sub command number\n\r\n\r");
    print_subcmd_usage(array, size);
    return;
  }

  /* Check sub command ID */
  value = string_to_num(argv[0]);
  if ((value < 0) || (value >= size))
  {
    printf("Unknown sub command [%s]\n\r\n\r", argv[0]);
    print_subcmd_usage(array, size);
    return;
  }

  /*
   * Test All command is also differently treated, regarding number of
   * arguments (0, 1, 2). So complete arguments to have a generic API including
   * number of valid arguments in third position.
   */
  if ((array == test) && (array[value].fct == DDR_Test_All))
  {
    switch (local_argc - 2)
    {
    case 0:
      argv1[0] = argv2[0] = argv3[0] = '0';
      argv1[1] = argv2[1] = argv3[1] = '\0';
      local_argc = array[value].max_args + 2;
      break;
    case 1:
      argv2[0] = argv3[0] = '0';
      argv2[1] = argv3[1] = '\0';
      local_argc = array[value].max_args + 2;
      break;
    case 2:
      argv3[0] = '0';
      argv3[1] = '\0';
      local_argc = array[value].max_args + 2;
      break;
    case 3:
      local_argc = array[value].max_args + 2;
      break;
    default:
      local_argc = -1;
      break;
    }
  }

  /* Check number of sub command arguments */
  if ((uint8_t)(local_argc - 2) != array[value].max_args)
  {
    /* any other cases */
    printf("Incorrect number of arguments\n\r\n\r");
    print_single_subcmd_usage(array, value);
    return;
  }

  /* Check argument validity */
  for (i = 1; i <= (local_argc - 2); i++)
  {
    if (string_to_num(argv[i]) < 0)
    {
      printf("Invalid argument #%d %s\n\r\n\r", i, argv[i]);
      print_single_subcmd_usage(array, value);
      return;
    }
  }

  switch (array[value].max_args)
  {
    case 0:
      retcode = array[value].fct();
      break;
    case 1:
      retcode = array[value].fct((uint32_t)string_to_num(argv[1]));
      break;
    case 2:
      retcode = array[value].fct((uint32_t)string_to_num(argv[1]),
                                (uint32_t)string_to_num(argv[2]));
      break;
    case 3:
      retcode = array[value].fct((uint32_t)string_to_num(argv[1]),
                                (uint32_t)string_to_num(argv[2]),
                                (uint32_t)string_to_num(argv[3]));
      break;
    default:
      printf("Number of arguments not supported\n\r");
      retcode = 0XFFFFFFFF;
      break;
  }

  if (retcode != 0)
  {
    printf("%s failed [%d]\n\r", array[value].name, retcode);
    return;
  }

  if (!silent_console)
  {
    printf("Result: Pass [%s]\n\r", array[value].name);
  }
}

bool HAL_DDR_Interactive(HAL_DDR_InteractStepTypeDef step)
{
  char buffer[CMD_MAX_LEN];
  char *argv[CMD_MAX_ARG + 1] = {argv0, argv1, argv2, argv3}; /* NULL terminated */
  int argc;
  int cmd;
  static int next_step = -1;
  bool remote_exit = false;

  if ((next_step < 0) && (step == STEP_DDR_RESET))
  {
    next_step = STEP_DDR_RESET;
  }

//  printf("** step %d ** %s / %d\n\r", step, step_str[step], next_step);

  if (next_step < 0)
  {
    return false;
  }

