ruvi-d/STM32DDRFW-UTIL/DDR_Tool/Common_MP2/Src/ddr_tool.c
  if (step > STEP_RUN)
  {
    printf("** step %d ** INVALID\n\r", step);
    return false;
  }

  if (!silent_console)
  {
    printf("%d:%s\n\r", step, step_str[step]);
  }

  if ((HAL_DDR_InteractStepTypeDef)next_step > step)
  {
    return false;
  }

  while (((HAL_DDR_InteractStepTypeDef)next_step == step) && !remote_exit)
  {
    if (silent_console)
    {
      if (back_to_test == 1)
      {
        /*
         * Test in remote mode has been interrupted.
         * Last operation was a step change.
         * Now move back to this test.
         */
        argc = 2;
        cmd = DDR_CMD_TEST;
        if (save_test_id == 1)
        {
          argv[0] = TEST_ARG_TX_DELAY_MARGINS;
        }
        else if (save_test_id == 2)
        {
          argv[0] = TEST_ARG_RX_DELAY_MARGINS;
        }
        else
        {
          printf("Wrong remote test id [%u]\n\r", save_test_id);
        }
        argv[1] = '\0';
        remote_exit = false;
        back_to_test = 0;
      }
      else
      {
        /*
         * Test in remote mode has been interrupted.
         * Execute the remote command.
         * If step change, then prepare to come back to test just after.
         */
        argc = remote_argc;
        cmd = remote_cmd;
        argv[0] = remote_argv0;
        argv[1] = remote_argv1;
        remote_exit = true;
	if (cmd == DDR_CMD_STEP)
        {
          back_to_test = 1;
        }
      }
    }
    else
    {
      get_entry_string(buffer);

      argc = parse_entry_string(buffer, strlen(buffer), &cmd, argv);
    }

    if (argc < 0)
    {
      printf("Error [%d]\n\r", argc);
      continue;
    }
    else if (argc == 0)
    {
      continue;
    }

    switch (cmd)
    {
    case DDR_CMD_HELP:
      print_usage();
      break;

    case DDR_CMD_TEST_HELP:
      print_subcmd_usage(test, test_nb);
      break;

    case DDR_CMD_INFO:
      do_info(step, argc, argv);
      break;

    case DDR_CMD_FREQ:
      do_freq(argc, argv);
      if ((argc == 2) && (step > STEP_CTL_INIT))
      {
        printf("### Please update PLL settings and DDR timings ###\n\r");
        printf("### in your project. Then rebuild and restart. ###\n\r");
      }
      break;

    case DDR_CMD_RESET:
      WRITE_REG(RCC->GRSTCSETR, 0x1U);
      break;

    case DDR_CMD_PARAM:
      do_param(step, argc, argv);
      break;

    case DDR_CMD_IMPEDANCE:
      do_impedance(step, argc, argv);
      break;

    case DDR_CMD_PRINT:
      do_print(step, argc, argv);
      break;

    case DDR_CMD_EDIT:
      HAL_DDR_Edit_Reg(argv0, argv1);
      break;

    case DDR_CMD_SAVE:
      HAL_DDR_Dump_Reg(NULL, true);
      break;

    case DDR_CMD_GO:
      next_step = STEP_RUN;
      printf("### Exit DDR INTERACTIVE mode. Please RESET the BOARD ###\n\r");
      break;

    case DDR_CMD_NEXT:
      next_step = step + 1;
      if (next_step == STEP_RUN)
      {
        printf("### Exit DDR INTERACTIVE mode. Please RESET the BOARD ###\n\r");
      }
      break;

    case DDR_CMD_STEP:
      next_step = do_step(step, argc, argv);
      break;

    case DDR_CMD_TEST:
      if (!check_step(step, STEP_DDR_READY) && !silent_console)
      {
        /*
         * If a test is executed in remote mode, it is able to change steps and
         * come back just after.
         */
        continue;
      }
      do_subcmd(argc, argv, test, test_nb);
      break;

    default:
      break;
    }
  }

  return next_step == STEP_DDR_RESET;
}
